### Substituir caracteres de strings de uma coluna
https://pandas.pydata.org/docs/reference/api/pandas.Series.str.replace.html

https://pandas.pydata.org/docs/reference/api/pandas.Series.str.slice_replace.html

In [1]:
import pandas as pd

#### Substituir caractere de string em python

In [2]:
a = "Pyladies Salvador"
a

'Pyladies Salvador'

In [4]:
a.replace("a","z")

'Pylzdies Szlvzdor'

#### Substituir caracters de strings de uma coluna usando o método str.replace()

In [5]:
df = pd.DataFrame({
    'nome':['Joana Silva', 'andreA saNtos', 'LeIla BarbOsa'],
    'data_nascimento':['01/04/2001', '05/06/1996', '15/10/1987'],
    'sexo':['feminino', '  feminino', ' feminino  '],
    'cpf':['093.434.324-16', '125.789.674-64', '154.849.764-64']
})
df

            nome data_nascimento         sexo             cpf
0    Joana Silva      01/04/2001     feminino  093.434.324-16
1  andreA saNtos      05/06/1996     feminino  125.789.674-64
2  LeIla BarbOsa      15/10/1987   feminino    154.849.764-64

In [6]:
df['data_nascimento'].str.replace('/','-')

0    01-04-2001
1    05-06-1996
2    15-10-1987
Name: data_nascimento, dtype: object

In [10]:
(df['cpf'].str.replace(".","", regex = False) # substitui o . por nada
          .str.replace("-","", regex = False) # substitui o - por nada
)

0    09343432416
1    12578967464
2    15484976464
Name: cpf, dtype: object

In [11]:
df['nome'].str.replace("a", "z")

0      Joznz Silvz
1    zndreA szNtos
2    LeIlz BzrbOsz
Name: nome, dtype: object

#### Substituir "fatia" de strings de uma coluna usando o método str.slice_replace()

In [12]:
df

            nome data_nascimento         sexo             cpf
0    Joana Silva      01/04/2001     feminino  093.434.324-16
1  andreA saNtos      05/06/1996     feminino  125.789.674-64
2  LeIla BarbOsa      15/10/1987   feminino    154.849.764-64

In [13]:
df['cpf'].str.slice_replace(start = 4, stop = 11, repl = 'x')

0    093.x-16
1    125.x-64
2    154.x-64
Name: cpf, dtype: object

In [15]:
df['cpf_anonimo'] = df['cpf'].str.slice_replace(start = 4, stop = 11, repl = 'xxx.xxx')
df

            nome data_nascimento         sexo             cpf     cpf_anonimo
0    Joana Silva      01/04/2001     feminino  093.434.324-16  093.xxx.xxx-16
1  andreA saNtos      05/06/1996     feminino  125.789.674-64  125.xxx.xxx-64
2  LeIla BarbOsa      15/10/1987   feminino    154.849.764-64  154.xxx.xxx-64